docs/installation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Install Instructions</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="./style.css">
</head>
<body>
<div id="content" class="content">
<div class="nav" id="nav">
    <a href="javascript:void(0);" onclick="myFunction()" class="menuicon"><b>MENU</b></a>
    <a href="./index.html">Home</a>
    <a href="./screenshots.html">Screenshots</a>
    <a href="./installation.html" class="current">Install KVOS</a>
    <a href="./guide.html">Guide</a>
    <a href="./software.html">Pre-Installed</a>
</div>

<div id="outline-container-org5a39b14" class="outline-2">
<h2 id="org5a39b14">Installing KVOS</h2>
<div class="outline-text-2" id="text-org5a39b14">
<p>
One can setup KVOS on a fresh setup of vanilla arch install by running the <a href="static/scripts/kvos-setup.sh">kvos-setup.sh</a> script.
</p>

<p>
There is also a script provided for installing vanilla arch. Let&rsquo;s start with that.
</p>
<hr />
</div>
<div id="outline-container-org4ee9c00" class="outline-3">
<h3 id="org4ee9c00">Install base arch linux</h3>
<div class="outline-text-3" id="text-org4ee9c00">
<ul class="org-ul">
<li>Download an Arch Linux ISO and write it to a USB</li>
<li>Boot from the live USB and connect to the internet</li>
<li><p>
From the command line execute following command
</p>
<div class="org-src-container">
<pre class="src src-bash">bash &lt;<span style="color: #b294bb;">(</span><span style="color: #f0c674;">curl</span> -s https://kanishakvaidya.github.io/arch-install.sh<span style="color: #b294bb;">)</span>
</pre>
</div></li>
<li>This will execute my <a href="static/scripts/base-installation.sh">arch install</a> script</li>
<li>This script will guide you through base arch install. (partitions and <code>pacstrap</code>)</li>
<li>Read the details about the scripts from the repository.</li>
<li><a href="static/scripts/configuration-script.sh">configuration-script.sh</a> will be executed automatically by this script. Here you need to configure
<ul class="org-ul">
<li>Hostname</li>
<li>root user password</li>
<li>New user with its password</li>
</ul></li>
</ul>
<hr />
</div>
</div>
<div id="outline-container-org27cb1d0" class="outline-3">
<h3 id="org27cb1d0">KVOS installation</h3>
<div class="outline-text-3" id="text-org27cb1d0">
<ul class="org-ul">
<li><p>
Download the <a href="static/scripts/kvos-setup.sh">kvos-setup.sh</a> script and run it from your user account. You can use the following command to download and run the setup file:
</p>
<div class="org-src-container">
<pre class="src src-bash">bash &lt;<span style="color: #b294bb;">(</span><span style="color: #f0c674;">curl</span> -s https://kanishakvaidya.github.io/kvos-setup.sh<span style="color: #b294bb;">)</span>
</pre>
</div></li>
<li>This script will add <a href="https://github.com/KanishakVaidya/kv-arch-repo">kv-arch-repo</a> to the repository list. It will open <a href="static/scripts/packages.md">packages.md</a> file in a text editor. Check the boxes corresponding to the softwares you want to install. You can also add your own software to the list by appending them to a section with -[X]</li>
<li>The directories in your <code>$HOME</code> will have shortened names for better accessibility from terminal.</li>
<li>Default theme is Materia Dark and default icon theme is Papirus.</li>
<li>Customize qt based apps using <code>qt5ct</code> and <code>kvantum</code>, customize gtk apps using <code>lxappearance</code>.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.6)</p>
</div>
</body>
</html>
